#include     <string.h>
#include    "platform.h"


QUEUE_Init_TypeDef COM_QUEUE;
/* ---------------------------------------------------------------------------------------------------
- º¯ÊýÃû³Æ: queue_init
- º¯Êý¹¦ÄÜ: ´®¿Ú»·ÐÎ¶ÓÁÐ³õÊ¼»¯
- ÊäÈë²ÎÊý: 
- ´´½¨ÈÕÆÚ: 2019-05-23
----------------------------------------------------------------------------------------------------*/
void queue_init(void)
{
    memset(&COM_QUEUE, 0, sizeof(COM_QUEUE));
}
/* ---------------------------------------------------------------------------------------------------
- º¯ÊýÃû³Æ: queue_empty
- º¯Êý¹¦ÄÜ: ÅÐ¶Ï´®¿Ú»·ÐÎ¶ÓÁÐÊÇ·ñÎª¿Õ
- ÊäÈë²ÎÊý: 
- ´´½¨ÈÕÆÚ: 2019-05-23
----------------------------------------------------------------------------------------------------*/
uint8_t queue_empty(void)
{
    if(COM_QUEUE.head == COM_QUEUE.tail)
    {
        return (1);
    }
    else
    {
        return (0);
    }
}
/* ---------------------------------------------------------------------------------------------------
- º¯ÊýÃû³Æ: queue_read
- º¯Êý¹¦ÄÜ: ¶Á´®¿Ú»·ÐÎ¶ÓÁÐ
- ÊäÈë²ÎÊý: 
- ´´½¨ÈÕÆÚ: 2019-05-23
----------------------------------------------------------------------------------------------------*/
uint8_t queue_read(void)
{
    uint8_t ucData = COM_QUEUE.data[COM_QUEUE.head++];

    COM_QUEUE.head %= QUEUE_SIZE;

    return ucData;
}
/* ---------------------------------------------------------------------------------------------------
- º¯ÊýÃû³Æ: queue_write
- º¯Êý¹¦ÄÜ: Ð´¶ ´®¿Ú»·ÐÎ¶ÓÁÐ
- ÊäÈë²ÎÊý: 
- ´´½¨ÈÕÆÚ: 2019-05-23
----------------------------------------------------------------------------------------------------*/
void queue_write(uint8_t value)
{
    COM_QUEUE.data[COM_QUEUE.tail++] = value;

    COM_QUEUE.tail %= QUEUE_SIZE;
}




/* ---------------------------------------------------------------------------------------------------
- º¯ÊýÃû³Æ: config_uart1_pin
- º¯Êý¹¦ÄÜ: UART1Òý½ÅÅäÖÃ
- ÊäÈë²ÎÊý: 
- ´´½¨ÈÕÆÚ: 2019-05-23
----------------------------------------------------------------------------------------------------*/
void config_uart1_pin()
{
    uint32_t	val;
	//ÅäÖÃGPIO18-UART1_TX    GPIO19-UART1_RX
	gpio_mux_ctl(18,0);gpio_fun_inter(18,0);gpio_fun_sel(18,UART1_TX);//UART1_TX 
    gpio_mux_ctl(19,0);gpio_fun_inter(19,0);gpio_fun_sel(19,UART1_RX);//UART1_RX 
	
}

/* ---------------------------------------------------------------------------------------------------
- º¯ÊýÃû³Æ: xc_uart1_init
- º¯Êý¹¦ÄÜ: uart1³õÊ¼ÅäÖÃ
- ÊäÈë²ÎÊý: 
- ´´½¨ÈÕÆÚ: 2019-05-23
----------------------------------------------------------------------------------------------------*/
extern  void xc_uart1_init(void)
{
    extern void at_init(void);
    config_uart1_pin();
	Init_uart(1, BAUD_115200);
	queue_init();
	at_init();
	Uart_Register_Callback(1, (uHandler_callback)queue_write);
}


